## Target env: terraform/env/eks
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Apply `failure`

<details><summary>Show Apply</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.vpc: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cluster_encription_key.aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.cluster_encription_key.aws_kms_key_policy.key_policy will be created
  + resource "aws_kms_key_policy" "key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = "\"{\\n    Statement = [\\n      {\\n        Action = \\\"kms:*\\\"\\n        Effect = \\\"Allow\\\"\\n        Principal = {\\n          \\\"AWS\\\" = arn:aws:sts::686355260515:assumed-role/AllowAccessFromIpro2023/GitHubActions\\\"\\n          }\\n\\n        Resource = \\\"*\\\"\\n        Sid      = \\\"EKS Cluster Encription Key\\\"\\n      },\\n    ]\\n    Version = \\\"2012-10-17\\\"\\n}\\n\""
    }

  # module.eks.data.aws_iam_policy_document.assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "ipro-2023-eks-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.25"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {}
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-08f862b3208c31080",
              + "subnet-096eed9b7dc0393b5",
              + "subnet-0ec848e0a2f8519f2",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.oidc will be created
  + resource "aws_iam_role" "oidc" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-odic-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

  # module.eks.aws_security_group.cluster_shared will be created
  + resource "aws_security_group" "cluster_shared" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ipro-2023-eks-cluster-cluster-shared"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ipro-2023-eks-cluster-cluster-shared"
        }
      + tags_all               = {
          + "Name" = "ipro-2023-eks-cluster-cluster-shared"
        }
      + vpc_id                 = "vpc-049a51e50c4adc058"
    }

  # module.eks.aws_security_group_rule.default_cluster_to_node will be created
  + resource "aws_security_group_rule" "default_cluster_to_node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.inter_node will be created
  + resource "aws_security_group_rule" "inter_node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node_to_default_cluster will be created
  + resource "aws_security_group_rule" "node_to_default_cluster" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
module.eks.aws_security_group.cluster_shared: Creating...
module.cluster_encription_key.aws_kms_key.key: Creating...
module.eks.aws_iam_role.cluster: Creating...
module.eks.aws_iam_role.cluster: Creation complete after 0s [id=eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Creating...
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Creating...
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Creation complete after 0s [id=eks-cluster-role-20230503113153169900000002]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Creation complete after 0s [id=eks-cluster-role-20230503113153120200000001]
module.eks.aws_eks_cluster.cluster: Creating...
module.cluster_encription_key.aws_kms_key.key: Creation complete after 1s [id=5d64478c-2e71-41cb-9f6b-57c669ff297c]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Creating...
module.eks.aws_security_group.cluster_shared: Creation complete after 3s [id=sg-0fe3e74284222e97a]
module.eks.aws_security_group_rule.inter_node: Creating...
module.eks.aws_security_group_rule.inter_node: Creation complete after 1s [id=sgrule-1806011714]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [10s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [20s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [30s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [40s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [50s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m0s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m10s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m20s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m30s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m40s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m50s elapsed]
Releasing state lock. This may take a few moments...
```

</details>